       IDENTIFICATION DIVISION.                                                 
       PROGRAM-ID.   PGM1.

       PROCEDURE DIVISION.

      *TELON--------------------
       
       IF eval-tab-arr = 'rolloff'
          DISPLAY 'HELLO'.
          
      *-----------------------------! END

      *****************************************************************         
      * OUT OF USER CODE...

       IF eval-tab-arr = 'rolloff'
          DISPLAY 'HELLO'.

